%%%-------------------------------------------------------------------
%% @doc nova_admin public API
%% @end
%%%-------------------------------------------------------------------

-module(simple_routes_app).

-behaviour(application).

%% Application callbacks
-export([start/2, stop/1]).

%%====================================================================
%% API
%%====================================================================

start(_StartType, _StartArgs) ->
    simple_routes_sup:start_link().

    % rebar3 nova serve, подключение к базе есть и без init
    % Инициализация базы данных
    % ok = database:init(),

    % Запуск Nova
    % nova:start().

%%--------------------------------------------------------------------
stop(_State) ->
    ok.

%%====================================================================
%% Internal functions
%%====================================================================
